<template>
    <div class="about_section">
        <title_section>О магазине «Мед-маркет.рф»</title_section>
        <p>
            Медтехника занимает важную роль в жизни человека, ведь ее использование необходимо не только в специализированных учреждениях, но и на дому. В нашем интернет-магазине можно найти приборы, которые можно использовать для процедур в домашних условиях, а также товары и расходные материалы для реабилитации. Все товары сертифицированы и поставляются с инструкциями и гарантией. Мы заботимся о своих клиентах, поэтому предоставляем полную информацию о приборах и аксессуарах, которые есть в нашем магазине. Ознакомиться с ассортиментом можно в разделе «Каталог».
            <br>
            <br>
            «МЕД-МАРКЕТ» является надежным спутником в борьбе за свое здоровье. У нас есть много косметологических приборов, улучшающих состояние кожи, способствующих похудению и стимулирующих рост волос. Мы выручим вас практически любой ситуации! Большой ассортимент товаров и низкие цены – все, что нужно для хороших покупок!
            <br>
            <br>
            Здесь вы можете купить медтехнику по приемлемым ценам, а многие товары и вовсе являются эксклюзивными и приобрести их можно только у нас. Особое внимание уделено ассортименту для трахеостомированных пациентов: представлен большой выбор аксессуаров и средств для людей с трахеостомой, которым удалили гортань и голосовые связки. Постоянно расширяется линейка товаров средств для реабилитации. В них особо нуждаются пожилые люди, инвалиды, а также те, кто перенес травмы и операции. Постоянное отслеживание ассортимента позволяет нам поддерживать актуальные товары и вводить быстро новые линейки, чтобы вы могли в одном месте приобрести все необходимое.
        </p>
    </div>
</template>

<script>
    import title_section from "../titles/title_section.vue";
    export default {
        name: "about_section",
        components: {
            title_section,
        }
    }
</script>

<style scoped lang="scss">
    .about_section {
        p {
            margin-top: 30px;
            font-family: Ubuntu;
            font-style: normal;
            font-weight: 300;
            font-size: 18px;
            line-height: 150%;
            color: #5A5A5A;
            @media (max-width: 768px) {
                margin-top: 12px;
            }
        }
    }
</style>