<template>
    <div>
        <section class="breadcrumbs_margins">
            <div class="container">
                <breadcrumbs>Доставка и оплата</breadcrumbs>
            </div>
        </section>
        <section style="margin-bottom: 0;">
            <div class="container">
                <title_page>Доставка и оплата</title_page>
                <h5 class="title-p">Условия доставки</h5>
                <p>
                    В случае курьерской доставки или получения заказа в пункте самовывоза Вам необходимо в присутствии
                    представителя транспортной компании проверить целостность упаковки и внутреннее содержимое заказа.
                    <br>
                    <br>
                    При обнаружении несоответствия внутреннего содержимого Вашему заказу, а также при наличии брака,
                    повреждения товара, представитель транспортной компании в Вашем присутствии составит акт о возврате
                    заказа.
                    <br>
                    <br>

                    В случае получения заказа в постамате при обнаружении несоответствия внутреннего содержимого вашему
                    заказу, а также при наличии брака, повреждения товара, необходимо сообщить об этом по телефону
                    Горячей линии Интернет-магазина.
                    <br>
                    <br>

                    Повторная доставка данного заказа будет осуществлена за наш счет в дополнительно согласованное с
                    Вами время.
                </p>


                <h5 class="title-p">Доставка по Краснодару</h5>
                <p>
                    Чтобы доставка прошла гладко, вам нужно:
                    <br>
                    <br>
                    1. Указать корректный адрес доставки
                    <br>
                    <br>

                    2. Быть на связи, иначе заказ будет отменен
                    <br>
                    <br>

                    3. Проверить заказ в присутствии курьера – замечания после подписания акта покупки не принимаются
                    <br>
                    <br>

                    4. Подготовить пропуск или компенсировать оплату проезда по закрытой территории нашему курьеру (если
                    в этом есть необходимость)
                    <br>
                    <br>

                    Мы не доставляем заказы на остановки общественного транспорта, в парки и другие места, не имеющие
                    определенного адреса.
                </p>

                <h5 class="title-p">Оплата курьерской доставки</h5>
                <p>
                    Доставка заказов физических лиц осуществляется после онлайн-оплаты заказа на сайте. Вы можете
                    оплатить заказ с помощью банковской карты Visa, MasterCard, Maestro или Мир сразу после создания
                    заказа.
                    <br>
                    <br>

                    Оплата заказов юридических лиц осуществляется в отделении банка по сформированному нашим менеджером
                    счёту к оплате.
                </p>

                <h5 class="title-p">Порядок получения заказа</h5>
                <p>
                    1. После оформления заказа Вы получаете подтверждение по указанному адресу электронной почты,
                    <br>
                    <br>
                    2. После подтверждения у опретатора интернет-магазина Ваш заказ передается на наш склад,
                    <br>
                    <br>

                    3. После получения курьерской компанией к Вам приходит СМС уведомление по указанному номеру
                    телефона, с уточнением даты, времени доставки и номером заказа.
                    <br>
                    <br>
                    После подтверждения заказа по телефону с менеджерами нашего Интернет-магазина Вы можете
                    самостоятельно отследить статус заказа в Call-центре по телефону или 8 (918) 363-97-33.
                </p>

                <h5 class="title-p">Способы оплаты</h5>
                <p style="margin-bottom: 0;">
                    1. Наличными при получении заказа
                    <br>
                    <br>
                    Вы оплачиваете заказ наличными курьеру или в пункте самовывоза.
                    <br>
                    <br>

                    2. Банковской картой
                    <br>
                    <br>

                    - при получении товара у курьера или в пунктах самовывоза (при наличии технической возможности).
                    <br>
                    <br>

                    - при онлайн оплате на сайте Интернет-магазина.
                    <br>
                    <br>

                    Для оплаты товара банковской картой в Интернет-магазине при оформлении заказа укажите способ оплаты
                    «Оплата онлайн». Оплата осуществляется непосредственно на сайте сразу после оформления заказа. После
                    подтверждения состава заказа, ваших личных данных и адреса доставки откроется страница, где вам
                    будет предложено ввести данные вашей банковской карты (номер карты, ФИО владельца, срок действия
                    карты, CVV/CVC код)*.
                    <br>
                    <br>

                    После ввода данных карты вам останется только проверить их и нажать кнопку «Оплатить». Оплата
                    происходит через авторизационный сервер процессингового центра банка с использованием банковских
                    карт следующих платежных систем: VISA, MasterCard, МИР.
                    <br>
                    <br>

                    При аннулировании позиций из заказа (или при аннулировании заказа целиком) и способе оплаты
                    банковской картой на сайте возврат денежных средств осуществляется в течение 30 рабочих дней на
                    банковскую карту клиента, указанную в заказе. Для возврата денежных средств вам необходимо выслать
                    письменное уведомление на адрес электронной почты Интернет-магазина.
                    <br>
                    <br>

                    * Передача этих сведений производится с соблюдением всех необходимых мер безопасности. Данные будут
                    сообщены только на авторизационный сервер банка по защищенному каналу (протокол SSL 3.0). Информация
                    передается в зашифрованном виде и сохраняется только на специализированном сервере платежной
                    системы. Сайты и магазины не знают и не хранят данные по вашей пластиковой карте.
                </p>
            </div>
        </section>
        <section style="background: #42B1A8; padding: 16px 0; margin: 40px 0;">
            <div class="container">
                <div class="green">Согласно Постановлению от 19.01.96 № 55, медицинские изделия входят в перечень
                    товаров, не подлежащих возврату или обмену.
                </div>
            </div>
        </section>
        <section style="margin-top: 0;">
            <div class="container">
                <h5 class="title-p">Правила приемки и возврата товара</h5>
                <p style="margin-bottom: 0;">
                    1. Покупатель вправе отказаться от Товара в любое время до его передачи (приемки).
                    <br>
                    <br>
                    2. Приемка товара
                    <br>
                    <br>

                    Покупатель должен в присутствии представителя транспортной компании убедиться в том, что упаковка
                    Товара целостная и не имеет следов вскрытия, товар соответствует заказанному (по ассортименту,
                    количеству, стоимости), передан в полной комплектации, не имеет механических повреждений.
                    <br>
                    <br>

                    В случае обнаружения несоответствия Товара по количеству, ассортименту, качеству и/или
                    комплектности, а также следов вскрытия упаковки Покупателю необходимо сообщить об этом представителю
                    транспортной компании, который составляет Акт об обнаружении недостачи или повреждении Товара.
                    <br>
                    <br>

                    Покупатель или Получатель подтверждает своей подписью в Бланке заказа, что не имеет претензий к
                    внешнему виду и комплектности Товара.
                    <br>
                    <br>

                    После приемки Товара и подписания документов, подтверждающих надлежащее исполнение Продавцом
                    обязанностей по передаче Товара, претензии по комплектации, внешнему виду, соответствию Товара
                    оформленному Заказу и неполной информации о Товаре не принимаются.
                    <br>
                    <br>

                    3. Возврат Товара надлежащего качества после приемки товара.
                    <br>
                    <br>

                    В течение 7 дней после передачи товара возможен возврат Товара надлежащего качества в случае, если
                    сохранены его товарный вид, потребительские свойства, а также документ, подтверждающий факт и
                    условия покупки.
                    <br>
                    <br>

                    Для подтверждения права на возврат Покупатель предоставляет Продавцу информацию о Заказе, фотографии
                    с ненарушенной упаковкой Товара и копии документов на оплату.
                    <br>
                    <br>

                    Возврату подлежит заказ в полном объеме.
                    <br>
                    <br>

                    Товар надлежащего качества, бывший в употреблении, возврату не подлежит.
                    <br>
                    <br>

                    При отказе Покупателя от Товара надлежащего качества Продавец возвращает ему стоимость Товара не
                    позднее чем через 10 дней с даты предъявления Покупателем соответствующего требования. Продавец
                    вправе удержать расходы на доставку от Покупателя возвращенного Товара.
                    <br>
                    <br>

                    4. Возврат Товара ненадлежащего качества (заводской брак).
                    <br>
                    <br>

                    Покупатель вправе предъявить претензии в отношении качества Товара в течение всего срока годности
                    Товара.
                    <br>
                    <br>

                    К письму должен быть приложен документ, подтверждающий факт и условия покупки Товара. Срок ответа на
                    претензию — не более 10 дней.
                    <br>
                    <br>

                    Продавец имеет право провести проверку качества, на которую Покупатель обязан предоставить Товар, а
                    также организовать проведение экспертизы в случае возникновения спора о причинах недостатка. Если по
                    результатам проверки качества и при необходимости экспертизы будет доказано, что за данный
                    недостаток отвечает Продавец, требование Покупателя будет удовлетворено. Если по результатам
                    проверки выяснится, что недостаток не обнаружен или Продавец не несет за него ответственности, то
                    Покупатель будет обязан компенсировать Продавцу затраты на проведение экспертизы и транспортные
                    расходы.
                    <br>
                    <br>

                    При положительном решении о возврате Товара ненадлежащего качества Продавец на выбор Покупателя
                    возвращает ему стоимость Товара или обменивает на аналогичный Товар надлежащего качества.
                </p>
            </div>
        </section>
    </div>
</template>

<script src="./delivery.js"></script>
<style scoped src="./delivery.scss" lang="scss"></style>