<template>
    <div class="examples_slides_wrapper">
        <div class="nav_row_carousel">
            <title_section class="title_section_discount">Выгодно со скидкой</title_section>
            <div class="nav_row_focus">
                <a href="/catalog" class="showAll">
                    <span>Просмотреть все предложения</span>
                    <svg width="9" height="14" viewBox="0 0 9 14" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M9 6.99942L1.71394 0L0 1.64678L5.57576 7.00408L0 12.3532L1.71394 14L9 6.99942Z"
                              fill="#42B1A8"/>
                    </svg>
                </a>
                <div class="nav_slider_button_group">
                    <button :disabled="disabled" @click="prev" class="btn_prev" ref="btn_prev">
                        <svg width="15" height="26" viewBox="0 0 15 26" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M12.4658 0.210936L0.0764286 12.9999L12.4658 25.7889L14.5319 23.6577L4.20572 12.9999L14.5319 2.34218L12.4658 0.210936Z"/>
                        </svg>
                    </button>
                    <button :disabled="disabled" @click="next" class="btn_next" ref="btn_next">
                        <svg width="15" height="26" viewBox="0 0 15 26" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M2.53425 25.7891L14.9236 13.0001L2.53425 0.211092L0.468147 2.34234L10.7943 13.0001L0.468147 23.6578L2.53425 25.7891Z"/>
                        </svg>
                    </button>
                </div>
            </div>
        </div>
        <div class="carousel_container">
            <div class="carousel_wrapper" ref="carousel" :key="current">
                <div ref="carousel_item" class="carousel_item" v-for="(item, index) in array"
                     :key="item*1222+index*321">
                    <template v-if="item === 1">
                        <div class="marker-wrapper">
                            <span class="marker-new">Новинка</span>
                            <span class="marker-discount">-30%</span>
                        </div>
                        <img src="../../../../public/images/prod.png" class="prod-image-card" alt="">
                        <p class="category-infocard">ETHICON</p>
                        <a href="" class="title-link">Синтетический рассасывающийся шовный материал VICRYL, RB-2,
                            длинна...</a>
                        <div class="cost-wrapper">
                            <div class="current-cost">
                                <h5>89 604</h5>
                                <svg width="11" height="14" viewBox="0 0 11 14" fill="none"
                                     xmlns="http://www.w3.org/2000/svg">
                                    <path d="M0.58696 6.64951H6.38406V8.31732H0.58696V6.64951ZM0.58696 9.61547H6.38406V11.2833H0.58696V9.61547ZM2.99233 6.64951H7.01569C7.39639 6.64951 7.73095 6.56067 8.01936 6.383C8.30778 6.20533 8.52986 5.95315 8.6856 5.62647C8.84711 5.29978 8.92787 4.92438 8.92787 4.50027C8.92787 4.07042 8.84711 3.69215 8.6856 3.36547C8.52986 3.03878 8.30778 2.7866 8.01936 2.60893C7.73095 2.42553 7.39639 2.33383 7.01569 2.33383H2.99233V0.666016H6.95512C7.705 0.666016 8.36546 0.826493 8.93652 1.14745C9.50758 1.46267 9.94885 1.90971 10.2603 2.48857C10.5776 3.06744 10.7362 3.738 10.7362 4.50027C10.7362 5.26253 10.5776 5.93309 10.2603 6.51196C9.94885 7.08509 9.50758 7.52927 8.93652 7.84449C8.36546 8.15971 7.705 8.31732 6.95512 8.31732H2.99233V6.64951ZM2.08382 0.666016H3.84891V13.166H2.08382V0.666016Z"
                                          fill="#B2B2B2"/>
                                </svg>
                            </div>
                            <div class="last-cost">
                                <h5>104 604</h5>
                                <span>руб</span>
                                <div class="pseudoline"></div>
                            </div>
                        </div>
                        <btn_small>
                            <svg width="21" height="21" viewBox="0 0 21 21" fill="none"
                                 xmlns="http://www.w3.org/2000/svg">
                                <g clip-path="url(#clip0)">
                                    <path d="M17.4279 11.8494L19.4744 6.36403C19.6287 5.95052 19.3225 5.50919 18.8809 5.50919H5.8944L5.37915 1.72237C5.34348 1.46013 5.14854 1.24774 4.89034 1.18974L2.28843 0.605324C1.94709 0.528837 1.60825 0.743212 1.5316 1.08451C1.45492 1.42585 1.66945 1.76473 2.01079 1.84137L4.1832 2.32931L5.64341 13.0758C5.68656 13.4238 6.00489 13.6712 6.35348 13.626L13.5311 12.6951L15.9429 14.1901C16.4492 14.5039 16.2275 15.2823 15.6319 15.2823H6.35399C6.00418 15.2823 5.72056 15.5658 5.72056 15.9157C5.72056 16.2655 6.00418 16.5491 6.35399 16.5491H15.6318C17.4965 16.5491 18.199 14.098 16.6103 13.1133L15.5196 12.4372L16.9159 12.2562C17.1488 12.226 17.3459 12.0695 17.4279 11.8494ZM6.82221 12.2878L6.13874 6.77608H17.9685L16.3744 11.049L6.82221 12.2878Z"
                                          fill="white"/>
                                    <path d="M7.73021 17.2764C6.75086 17.2764 5.95409 18.0731 5.95409 19.0525C5.95409 20.0318 6.75086 20.8286 7.73021 20.8286C8.70957 20.8286 9.50634 20.0318 9.50634 19.0525C9.50634 18.0731 8.70957 17.2764 7.73021 17.2764ZM7.73021 19.5618C7.44941 19.5618 7.22094 19.3333 7.22094 19.0525C7.22094 18.7717 7.44941 18.5433 7.73021 18.5433C8.01102 18.5433 8.23949 18.7717 8.23949 19.0525C8.23949 19.3333 8.01102 19.5618 7.73021 19.5618Z"
                                          fill="white"/>
                                    <path d="M13.8445 17.2764C12.8652 17.2764 12.0684 18.0731 12.0684 19.0525C12.0684 20.0318 12.8652 20.8286 13.8445 20.8286C14.8239 20.8286 15.6207 20.0318 15.6207 19.0525C15.6207 18.0731 14.8239 17.2764 13.8445 17.2764ZM13.8445 19.5618C13.5637 19.5618 13.3353 19.3333 13.3353 19.0525C13.3353 18.7717 13.5637 18.5433 13.8445 18.5433C14.1253 18.5433 14.3538 18.7717 14.3538 19.0525C14.3538 19.3333 14.1254 19.5618 13.8445 19.5618Z"
                                          fill="white"/>
                                </g>
                                <defs>
                                    <clipPath id="clip0">
                                        <rect width="20.2392" height="20.2392" fill="white"
                                              transform="translate(0.395874 0.589844)"/>
                                    </clipPath>
                                </defs>
                            </svg>
                            В корзину
                        </btn_small>
                    </template>
                    <template v-if="item === 2">
                        <div class="marker-wrapper">
                            <span class="marker-empty">Нет в наличии</span>
                        </div>
                        <img src="../../../../public/images/prod.png" class="prod-image-card" alt="">
                        <p class="category-infocard">ETHICON</p>
                        <a href="" class="title-link">Синтетический рассасывающийся шовный материал VICRYL, RB-2,
                            длинна...</a>
                        <div class="cost-wrapper">
                            <div class="current-cost">
                                <h5>89 604</h5>
                                <svg width="11" height="14" viewBox="0 0 11 14" fill="none"
                                     xmlns="http://www.w3.org/2000/svg">
                                    <path d="M0.58696 6.64951H6.38406V8.31732H0.58696V6.64951ZM0.58696 9.61547H6.38406V11.2833H0.58696V9.61547ZM2.99233 6.64951H7.01569C7.39639 6.64951 7.73095 6.56067 8.01936 6.383C8.30778 6.20533 8.52986 5.95315 8.6856 5.62647C8.84711 5.29978 8.92787 4.92438 8.92787 4.50027C8.92787 4.07042 8.84711 3.69215 8.6856 3.36547C8.52986 3.03878 8.30778 2.7866 8.01936 2.60893C7.73095 2.42553 7.39639 2.33383 7.01569 2.33383H2.99233V0.666016H6.95512C7.705 0.666016 8.36546 0.826493 8.93652 1.14745C9.50758 1.46267 9.94885 1.90971 10.2603 2.48857C10.5776 3.06744 10.7362 3.738 10.7362 4.50027C10.7362 5.26253 10.5776 5.93309 10.2603 6.51196C9.94885 7.08509 9.50758 7.52927 8.93652 7.84449C8.36546 8.15971 7.705 8.31732 6.95512 8.31732H2.99233V6.64951ZM2.08382 0.666016H3.84891V13.166H2.08382V0.666016Z"
                                          fill="#B2B2B2"/>
                                </svg>
                            </div>
                            <div class="last-cost">
                                <h5>104 604</h5>
                                <span>руб</span>
                                <div class="pseudoline"></div>
                            </div>
                        </div>
                        <btn_small_empty>
                            Нет в наличии
                        </btn_small_empty>
                    </template>
                    <template v-if="item === 3">
                        <div class="marker-wrapper">
                            <span class="marker-empty">Нет в наличии</span>
                        </div>
                        <img src="../../../../public/images/prod.png" class="prod-image-card" alt="">
                        <p class="category-infocard">ETHICON</p>
                        <a href="" class="title-link">Синтетический рассасывающийся шовный материал VICRYL, RB-2,
                            длинна...</a>
                        <div class="cost-wrapper">
                            <div class="current-cost">
                                <h5>89 604</h5>
                                <svg width="11" height="14" viewBox="0 0 11 14" fill="none"
                                     xmlns="http://www.w3.org/2000/svg">
                                    <path d="M0.58696 6.64951H6.38406V8.31732H0.58696V6.64951ZM0.58696 9.61547H6.38406V11.2833H0.58696V9.61547ZM2.99233 6.64951H7.01569C7.39639 6.64951 7.73095 6.56067 8.01936 6.383C8.30778 6.20533 8.52986 5.95315 8.6856 5.62647C8.84711 5.29978 8.92787 4.92438 8.92787 4.50027C8.92787 4.07042 8.84711 3.69215 8.6856 3.36547C8.52986 3.03878 8.30778 2.7866 8.01936 2.60893C7.73095 2.42553 7.39639 2.33383 7.01569 2.33383H2.99233V0.666016H6.95512C7.705 0.666016 8.36546 0.826493 8.93652 1.14745C9.50758 1.46267 9.94885 1.90971 10.2603 2.48857C10.5776 3.06744 10.7362 3.738 10.7362 4.50027C10.7362 5.26253 10.5776 5.93309 10.2603 6.51196C9.94885 7.08509 9.50758 7.52927 8.93652 7.84449C8.36546 8.15971 7.705 8.31732 6.95512 8.31732H2.99233V6.64951ZM2.08382 0.666016H3.84891V13.166H2.08382V0.666016Z"
                                          fill="#B2B2B2"/>
                                </svg>
                            </div>
                            <div class="last-cost">
                                <h5>104 604</h5>
                                <span>руб</span>
                                <div class="pseudoline"></div>
                            </div>
                        </div>
                        <btn_small_empty>
                            Нет в наличии
                        </btn_small_empty>
                    </template>
                    <template v-if="item === 4">
                        <div class="marker-wrapper">
                            <span class="marker-empty">Нет в наличии</span>
                        </div>
                        <img src="../../../../public/images/prod.png" class="prod-image-card" alt="">
                        <p class="category-infocard">ETHICON</p>
                        <a href="" class="title-link">Синтетический рассасывающийся шовный материал VICRYL, RB-2,
                            длинна...</a>
                        <div class="cost-wrapper">
                            <div class="current-cost">
                                <h5>89 604</h5>
                                <svg width="11" height="14" viewBox="0 0 11 14" fill="none"
                                     xmlns="http://www.w3.org/2000/svg">
                                    <path d="M0.58696 6.64951H6.38406V8.31732H0.58696V6.64951ZM0.58696 9.61547H6.38406V11.2833H0.58696V9.61547ZM2.99233 6.64951H7.01569C7.39639 6.64951 7.73095 6.56067 8.01936 6.383C8.30778 6.20533 8.52986 5.95315 8.6856 5.62647C8.84711 5.29978 8.92787 4.92438 8.92787 4.50027C8.92787 4.07042 8.84711 3.69215 8.6856 3.36547C8.52986 3.03878 8.30778 2.7866 8.01936 2.60893C7.73095 2.42553 7.39639 2.33383 7.01569 2.33383H2.99233V0.666016H6.95512C7.705 0.666016 8.36546 0.826493 8.93652 1.14745C9.50758 1.46267 9.94885 1.90971 10.2603 2.48857C10.5776 3.06744 10.7362 3.738 10.7362 4.50027C10.7362 5.26253 10.5776 5.93309 10.2603 6.51196C9.94885 7.08509 9.50758 7.52927 8.93652 7.84449C8.36546 8.15971 7.705 8.31732 6.95512 8.31732H2.99233V6.64951ZM2.08382 0.666016H3.84891V13.166H2.08382V0.666016Z"
                                          fill="#B2B2B2"/>
                                </svg>
                            </div>
                            <div class="last-cost">
                                <h5>104 604</h5>
                                <span>руб</span>
                                <div class="pseudoline"></div>
                            </div>
                        </div>
                        <btn_small_empty>
                            Нет в наличии
                        </btn_small_empty>
                    </template>
                    <template v-if="item === 5">
                        <div class="marker-wrapper">
                            <span class="marker-empty">Нет в наличии</span>
                        </div>
                        <img src="../../../../public/images/prod.png" class="prod-image-card" alt="">
                        <p class="category-infocard">ETHICON</p>
                        <a href="" class="title-link">Синтетический рассасывающийся шовный материал VICRYL, RB-2,
                            длинна...</a>
                        <div class="cost-wrapper">
                            <div class="current-cost">
                                <h5>89 604</h5>
                                <svg width="11" height="14" viewBox="0 0 11 14" fill="none"
                                     xmlns="http://www.w3.org/2000/svg">
                                    <path d="M0.58696 6.64951H6.38406V8.31732H0.58696V6.64951ZM0.58696 9.61547H6.38406V11.2833H0.58696V9.61547ZM2.99233 6.64951H7.01569C7.39639 6.64951 7.73095 6.56067 8.01936 6.383C8.30778 6.20533 8.52986 5.95315 8.6856 5.62647C8.84711 5.29978 8.92787 4.92438 8.92787 4.50027C8.92787 4.07042 8.84711 3.69215 8.6856 3.36547C8.52986 3.03878 8.30778 2.7866 8.01936 2.60893C7.73095 2.42553 7.39639 2.33383 7.01569 2.33383H2.99233V0.666016H6.95512C7.705 0.666016 8.36546 0.826493 8.93652 1.14745C9.50758 1.46267 9.94885 1.90971 10.2603 2.48857C10.5776 3.06744 10.7362 3.738 10.7362 4.50027C10.7362 5.26253 10.5776 5.93309 10.2603 6.51196C9.94885 7.08509 9.50758 7.52927 8.93652 7.84449C8.36546 8.15971 7.705 8.31732 6.95512 8.31732H2.99233V6.64951ZM2.08382 0.666016H3.84891V13.166H2.08382V0.666016Z"
                                          fill="#B2B2B2"/>
                                </svg>
                            </div>
                            <div class="last-cost">
                                <h5>104 604</h5>
                                <span>руб</span>
                                <div class="pseudoline"></div>
                            </div>
                        </div>
                        <btn_small_empty>
                            Нет в наличии
                        </btn_small_empty>
                    </template>
                    <template v-if="item === 6">
                        <div class="marker-wrapper">
                            <span class="marker-empty">Нет в наличии</span>
                        </div>
                        <img src="../../../../public/images/prod.png" class="prod-image-card" alt="">
                        <p class="category-infocard">ETHICON</p>
                        <a href="" class="title-link">Синтетический рассасывающийся шовный материал VICRYL, RB-2,
                            длинна...</a>
                        <div class="cost-wrapper">
                            <div class="current-cost">
                                <h5>89 604</h5>
                                <svg width="11" height="14" viewBox="0 0 11 14" fill="none"
                                     xmlns="http://www.w3.org/2000/svg">
                                    <path d="M0.58696 6.64951H6.38406V8.31732H0.58696V6.64951ZM0.58696 9.61547H6.38406V11.2833H0.58696V9.61547ZM2.99233 6.64951H7.01569C7.39639 6.64951 7.73095 6.56067 8.01936 6.383C8.30778 6.20533 8.52986 5.95315 8.6856 5.62647C8.84711 5.29978 8.92787 4.92438 8.92787 4.50027C8.92787 4.07042 8.84711 3.69215 8.6856 3.36547C8.52986 3.03878 8.30778 2.7866 8.01936 2.60893C7.73095 2.42553 7.39639 2.33383 7.01569 2.33383H2.99233V0.666016H6.95512C7.705 0.666016 8.36546 0.826493 8.93652 1.14745C9.50758 1.46267 9.94885 1.90971 10.2603 2.48857C10.5776 3.06744 10.7362 3.738 10.7362 4.50027C10.7362 5.26253 10.5776 5.93309 10.2603 6.51196C9.94885 7.08509 9.50758 7.52927 8.93652 7.84449C8.36546 8.15971 7.705 8.31732 6.95512 8.31732H2.99233V6.64951ZM2.08382 0.666016H3.84891V13.166H2.08382V0.666016Z"
                                          fill="#B2B2B2"/>
                                </svg>
                            </div>
                            <div class="last-cost">
                                <h5>104 604</h5>
                                <span>руб</span>
                                <div class="pseudoline"></div>
                            </div>
                        </div>
                        <btn_small_empty>
                            Нет в наличии
                        </btn_small_empty>
                    </template>
                </div>
            </div>
        </div>
    </div>
</template>

<script src="./carousel.js"></script>
<style src="./carousel.scss" scoped lang="scss"></style>
